---
kind: method
id: M:Autodesk.Revit.DB.DefinitionGroups.Dispose
source: html/993f7d7c-c01c-efb7-ce1f-7518c38b340c.htm
---
# Autodesk.Revit.DB.DefinitionGroups.Dispose Method

Releases all resources used by the DefinitionGroups

## Syntax (C#)
```csharp
public void Dispose()
```